Dlubal.RFEM5.FreeCircularLoad
Free circular load parameters.

Dlubal.RFEM5.FreeCircularLoad.No
Number

Dlubal.RFEM5.FreeCircularLoad.ID
Identifier

Dlubal.RFEM5.FreeCircularLoad.Comment
Comment

Dlubal.RFEM5.FreeCircularLoad.Tag
Tag

Dlubal.RFEM5.FreeCircularLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.FreeCircularLoad.SurfaceList
List of surfaces on which is load defined.

Dlubal.RFEM5.FreeCircularLoad.ProjectionPlane
Projection plane of load

Dlubal.RFEM5.FreeCircularLoad.Direction
Load direction

Dlubal.RFEM5.FreeCircularLoad.Distribution
Load distribution

Dlubal.RFEM5.FreeCircularLoad.Magnitude1
Magnitude of load at the center position.

Dlubal.RFEM5.FreeCircularLoad.Magnitude2
Magnitude of load at the radius position.

Dlubal.RFEM5.FreeCircularLoad.Position
Position of the load.

Dlubal.RFEM5.FreeCircularLoad.Radius
Circular load radius R.